{
  "AppleDisease": {
    "alternaria_leaf_spot": {
      "name": "Bệnh đốm lá xen kẽ trên Táo",
      "info": {
        "description": "Đây là một bệnh do nấm Alternaria gây ra. Nó thường xuất hiện dưới dạng các đốm nhỏ màu nâu hoặc đen trên lá, có thể mở rộng và hợp lại tạo thành các vết đốm lớn hơn với viền màu vàng.",
        "agent": "Nấm Alternaria",
        "symptom": "Lá bị nhiễm bệnh có thể khô héo và rụng sớm. Bệnh này có thể ảnh hưởng đến năng suất và chất lượng của quả."
      }
    },
    "brown_spot": {
      "name": "Bệnh đốm nâu trên Táo",
      "info": {
        "description": "Bệnh này thường do nấm hoặc vi khuẩn gây ra. Các đốm nâu xuất hiện trên lá, thân, hoặc quả cây táo.",
        "agent": "Nấm hoặc vi khuẩn",
        "symptom": "Các vết đốm có thể có viền màu sẫm hơn, và khi bệnh nặng, các vết đốm có thể hợp lại và gây rụng lá sớm, giảm khả năng quang hợp của cây."
      }
    },
    "gray_spot": {
      "name": "Bệnh đốm xám trên Táo",
      "info": {
        "description": "Đây là một bệnh do nấm Botryosphaeria gây ra. Các vết đốm thường có màu xám hoặc bạc, xuất hiện trên lá, cành và quả.",
        "agent": "Nấm Botryosphaeria",
        "symptom": "Bệnh có thể làm lá bị khô héo và rụng sớm, ảnh hưởng đến sự phát triển của cây và chất lượng quả."
      }
    },
    "healthy_leaf": {
      "name": "Lá khỏe mạnh trên Táo",
      "info": {
        "description": "Một lá khỏe mạnh của cây táo sẽ có màu xanh đều, không có các vết đốm hoặc dấu hiệu của bệnh tật."
      }
    },
    "rust": {
      "name": " Bệnh Rust (Gỉ sắt) trên Táo",
      "info": {
        "description": "Đây là một bệnh do nấm gây ra, thường là Gymnosporangium juniperi-virginianae. Bệnh gỉ sắt xuất hiện dưới dạng các đốm màu vàng cam hoặc đỏ trên lá, thân, hoặc quả.",
        "agent": "Nấm Gymnosporangium juniperi-virginianae",
        "symptom": "Các đốm này thường phát triển thành các mụn nhỏ, có thể tiết ra chất dịch màu cam. Bệnh này có thể làm lá rụng sớm và ảnh hưởng đến sự phát triển của quả."
      }
    }
  },
  "BellPepperDisease": {
    "bacterial_spot": {
      "name": " Bệnh đốm vi khuẩn trên Ớt chuông",
      "info": {
        "description": "Bệnh đốm vi khuẩn trên cây ớt chuông do vi khuẩn thuộc chi Xanthomonas gây ra. Đây là một trong những bệnh phổ biến và nghiêm trọng trên cây ớt chuông.",
        "agent": "Vi khuẩn Xanthomonas",
        "symptom": "Các đốm nhỏ, màu nâu đen hoặc nâu vàng xuất hiện trên lá, thường có viền màu vàng xung quanh. Khi bệnh nặng, các đốm này có thể mở rộng và hợp lại, làm cho lá bị héo và rụng sớm."
      }
    },
    "healthy": {
      "name": "Lá khỏe mạnh",
      "info": {
        "description": "Một cây ớt chuông khỏe mạnh không có dấu hiệu của bệnh tật hoặc sâu bệnh hại."
      }
    }
  },
  "CassavaDisease": {
    "bacterial_blight": {
      "name": "Bệnh đốm vi khuẩn",
      "info": {
        "description": "Bệnh đốm vi khuẩn trên cây sắn gây ra bởi vi khuẩn Xanthomonas axonopodis pv. manihotis.",
        "agent": "Vi khuẩn Xanthomonas axonopodis pv. manihotis",
        "symptom": "Lá cây xuất hiện các đốm nhỏ màu nước hoặc nâu, sau đó lan rộng thành các vết đốm lớn, lá bị quăn lại và chết dần."
      }
    },
    "brown_streak_disease": {
      "name": "Bệnh sọc nâu",
      "info": {
        "description": "Bệnh sọc nâu là một trong những bệnh nguy hiểm nhất trên cây sắn, gây ra bởi virus Cassava Brown Streak Virus (CBSV).",
        "agent": "Virus Cassava Brown Streak Virus (CBSV)",
        "symptom": "Thân cây xuất hiện các vết sọc nâu, lá cây có thể bị đốm vàng hoặc nâu, củ sắn bị thối và biến màu."
      }
    },
    "green_mottle": {
      "name": "Bệnh vằn xanh",
      "info": {
        "description": "Bệnh vằn xanh trên cây sắn gây ra bởi vi khuẩn Pseudomonas syringae pv. cassavae.",
        "agent": "Vi khuẩn Pseudomonas syringae pv. cassavae",
        "symptom": "Lá cây xuất hiện các vết vằn xanh, cây bị suy yếu, lá rụng và cây chết dần."
      }
    },
    "healthy": {
      "name": "Cây khỏe mạnh",
      "info": {
        "description": "Cây sắn không có dấu hiệu nhiễm bệnh, lá xanh tươi, thân cây khỏe mạnh và không có vết đốm hoặc tổn thương nào."
      }
    },
    "mosaic_disease": {
      "name": "Bệnh khảm lá",
      "info": {
        "description": "Bệnh khảm lá trên cây sắn gây ra bởi virus Cassava Mosaic Virus (CMV).",
        "agent": "Virus Cassava Mosaic Virus (CMV)",
        "symptom": "Lá cây xuất hiện các vết khảm, màu xanh và vàng xen kẽ, lá bị biến dạng và cây không phát triển tốt."
      }
    }
  },
  "CherryDisease": {
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây cherry khỏe mạnh không có dấu hiệu của bệnh tật hoặc sâu bệnh hại. Cây khỏe mạnh sẽ phát triển tốt, cho lá xanh tươi, cành vững chắc, và quả chất lượng cao."
      }
    },
    "powdery_mildew": {
      "name": "Bệnh phấn trắng trên Chery",
      "info": {
        "description": "Bệnh phấn trắng trên cây cherry do nhiều loại nấm thuộc nhóm Erysiphales gây ra. Đây là một trong những bệnh phổ biến trên nhiều loại cây, bao gồm cả cherry.",
        "agent": "Nấm nhóm Erysiphales",
        "symptom": "Xuất hiện lớp phủ màu trắng như phấn trên bề mặt lá, thường ở mặt trên. Các lá bị nhiễm bệnh có thể bị xoăn, biến dạng và rụng sớm."
      }
    }
  },
  "ChiliDisease": {
    "healthy": {
      "name": "Cây khỏe mạnh",
      "info": {
        "description": "Cây ớt không có dấu hiệu của bất kỳ bệnh tật nào, lá xanh tươi và không có vết đốm hay sâu bệnh."
      }
    },
    "leaf_curl": {
      "name": "Bệnh xoăn lá",
      "info": {
        "description": "Lá cây ớt bị xoăn, cuốn và biến dạng, làm giảm khả năng quang hợp và năng suất.",
        "agent": "Virus",
        "symptom": "Lá xoăn, nhỏ lại và biến dạng, cây còi cọc và giảm năng suất."
      }
    },
    "leaf_spot": {
      "name": "Bệnh đốm lá",
      "info": {
        "description": "Lá cây ớt xuất hiện các đốm màu nâu hoặc đen, lá có thể rụng sớm và ảnh hưởng đến sức khỏe của cây.",
        "agent": "Nấm hoặc vi khuẩn",
        "symptom": "Các đốm nâu hoặc đen trên lá, lá có thể bị rụng sớm."
      }
    },
    "whitefly": {
      "name": "Bệnh rệp trắng",
      "info": {
        "description": "Cây ớt bị tấn công bởi rệp trắng, chúng hút nhựa cây và truyền bệnh, làm cho lá bị vàng và rụng.",
        "agent": "Côn trùng",
        "symptom": "Lá vàng, rụng lá, cây yếu và có thể chết nếu bị nặng."
      }
    },
    "yellowish": {
      "name": "Bệnh vàng lá",
      "info": {
        "description": "Lá cây ớt chuyển sang màu vàng do thiếu dinh dưỡng hoặc nhiễm bệnh, làm giảm khả năng quang hợp và sức khỏe của cây.",
        "agent": "Thiếu dinh dưỡng hoặc vi khuẩn",
        "symptom": "Lá chuyển sang màu vàng, cây còi cọc và giảm năng suất."
      }
    }
  },
  "CitrusDisease": {
    "black_spot": {
      "name": "Đốm đen trên cây Cam",
      "info": {
        "description": "Miêu tả: Đây là một bệnh phổ biến trên cây cam, do nấm Guignardia citricarpa gây ra. Các vết đốm đen thường xuất hiện trên lá, có thể phát triển thành các vết lớn với thời gian.\nTriệu chứng: Lá bị nhiễm bệnh có thể bị héo và rụng sớm, ảnh hưởng đến năng suất và chất lượng của quả.",
        "agent": "Nấm Guignardia citricarpa",
        "symptom": "Các vết đốm đen trên lá, khi nặng có thể làm héo và rụng lá sớm."
      }
    },
    "canker": {
      "name": "Loét trên cây Cam",
      "info": {
        "description": "Miêu tả: Bệnh loét trên cây cam là do vi khuẩn gây ra, chủ yếu là Xanthomonas axonopodis.\nTriệu chứng: Các loét thường xuất hiện trên vỏ thân, cành và quả cam, gây ra các vết thương và làm suy yếu cây.",
        "agent": "Vi khuẩn Xanthomonas axonopodis",
        "symptom": "Loét xuất hiện trên vỏ thân, cành và quả cam, gây ra các vết thương."
      }
    },
    "greening": {
      "name": "Bệnh huỳnh quang trên Cây cam",
      "info": {
        "description": "Miêu tả: Bệnh huỳnh quang (citrus greening) là một trong những bệnh nghiêm trọng nhất trên cây cam, do vi khuẩn Candidatus Liberibacter spp. gây ra.\nTriệu chứng: Các triệu chứng chính là lá bị ố vàng mất màu, quả nhỏ, chát, và có thể có hình dạng bất thường.",
        "agent": "Vi khuẩn Candidatus Liberibacter spp.",
        "symptom": "Lá bị ố vàng, quả nhỏ, chát, và có thể biến dạng."
      }
    },
    "healthy": {
      "name": "Cây cam khỏe mạnh",
      "info": {
        "description": "Miêu tả: Một cây cam khỏe mạnh sẽ có lá xanh tươi, quả to và đầy sức sống, không có dấu hiệu của bệnh tật hoặc sâu bệnh hại."
      }
    },
    "melanose": {
      "name": "Bệnh nám trên cây Cam",
      "info": {
        "description": "Miêu tả: Bệnh nám trên cây cam là do nấm Diaporthe citri gây ra. Các vết nám thường xuất hiện trên lá, cành và quả cam.\nTriệu chứng: Các vết nám có màu nâu sẫm, có thể làm héo và rụng lá, ảnh hưởng đến sự phát triển của cây và chất lượng quả.",
        "agent": "Nấm Diaporthe citri",
        "symptom": "Vết nám màu nâu sẫm trên lá, cành và quả cam."
      }
    }
  },
  "CoconutDisease": {
    "caterpillars": {
      "name": "Sâu bọ",
      "info": {
        "description": "Sâu bọ tấn công lá và quả non của cây dừa, gây hại nghiêm trọng đến năng suất.",
        "agent": "Các loại sâu bọ, chủ yếu là sâu đục thân, sâu ăn lá.",
        "symptom": "Lá và quả bị sâu ăn, để lại các lỗ thủng và vết cắn."
      }
    },
    "drying_of_leaflets": {
      "name": "Khô lá",
      "info": {
        "description": "Khô lá là hiện tượng lá cây dừa bị khô, vàng và rụng dần.",
        "agent": "Có thể do thiếu nước, thiếu dinh dưỡng hoặc nhiễm bệnh.",
        "symptom": "Lá khô, chuyển màu vàng và rụng."
      }
    },
    "flaccidity": {
      "name": "Lá rủ",
      "info": {
        "description": "Lá rủ là hiện tượng lá cây dừa bị mềm, yếu và không còn cứng cáp.",
        "agent": "Có thể do thiếu nước, thiếu dinh dưỡng hoặc bị nhiễm bệnh.",
        "symptom": "Lá mềm, yếu và không còn cứng cáp."
      }
    },
    "leaflets": {
      "name": "Bệnh đốm lá",
      "info": {
        "description": "Bệnh đốm lá là hiện tượng lá cây dừa xuất hiện các đốm màu nâu hoặc đen.",
        "agent": "Thường do nấm hoặc vi khuẩn gây ra.",
        "symptom": "Lá xuất hiện các đốm màu nâu hoặc đen, lá khô và rụng."
      }
    },
    "yellowing": {
      "name": "Vàng lá",
      "info": {
        "description": "Vàng lá là hiện tượng lá cây dừa chuyển sang màu vàng và khô héo.",
        "agent": "Thường do thiếu dinh dưỡng, thiếu nước hoặc nhiễm bệnh.",
        "symptom": "Lá chuyển màu vàng, khô và rụng."
      }
    }
  },

  "CoffeeDisease": {
    "cercospora_leaf_spot": {
      "name": "Bệnh đốm lá Cercospora",
      "info": {
        "description": "Bệnh đốm lá Cercospora gây ra các đốm nhỏ, tròn hoặc hình bầu dục trên lá cây cà phê, thường có màu nâu hoặc đen với viền màu vàng.",
        "agent": "Nấm Cercospora coffeicola",
        "symptom": "Các đốm nâu hoặc đen trên lá, viền màu vàng xung quanh đốm, lá bị khô và rụng sớm."
      }
    },
    "healthy": {
      "name": "Cây khỏe mạnh",
      "info": {
        "description": "Cây cà phê khỏe mạnh không bị ảnh hưởng bởi bất kỳ bệnh tật nào, lá xanh tươi và không có đốm hay dấu hiệu bệnh."
      }
    },
    "red_spider_mite": {
      "name": "Bệnh nhện đỏ",
      "info": {
        "description": "Nhện đỏ gây hại bằng cách hút dịch từ lá cây cà phê, khiến lá bị vàng, khô và rụng.",
        "agent": "Nhện đỏ (Tetranychus urticae)",
        "symptom": "Lá vàng, khô và rụng sớm, xuất hiện mạng nhện mỏng trên lá."
      }
    },
    "rust": {
      "name": "Bệnh gỉ sắt",
      "info": {
        "description": "Bệnh gỉ sắt gây ra các đốm màu cam hoặc đỏ trên lá, dẫn đến lá bị khô và rụng.",
        "agent": "Nấm Hemileia vastatrix",
        "symptom": "Các đốm màu cam hoặc đỏ trên lá, lá bị khô và rụng sớm."
      }
    }
  },
  "CornDisease": {
    "common_rust": {
      "name": "Bệnh Rust (Gỉ sắt) trên Ngô",
      "info": {
        "description": "Đây là một bệnh phổ biến trên cây ngô, do nấm Puccinia sorghi gây ra. Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu đỏ trên lá, thân và cả nhánh hoa.",
        "agent": "Nấm Puccinia sorghi",
        "symptom": "Các vết bệnh có thể lan ra khắp cây, khiến cho lá bị sạm màu và rụng sớm, gây giảm năng suất và chất lượng nông sản."
      }
    },
    "gray_leaf_spot": {
      "name": "Bệnh Đốm lá xám trên Ngô",
      "info": {
        "description": "Đây là một bệnh do nấm Cercospora zea-maydis gây ra. Các vết bệnh thường xuất hiện dưới dạng các đốm màu xám trên lá của cây ngô.",
        "agent": "Nấm Cercospora zea-maydis",
        "symptom": "Các lá bị nhiễm bệnh thường có những vết đốm màu xám trên bề mặt, khiến cho lá và cây suy yếu."
      }
    },
    "healthy": {
      "name": "Lá khỏe mạnh",
      "info": {
        "description": "Một cây ngô khỏe mạnh sẽ có lá màu xanh tươi, không có dấu hiệu của bệnh tật."
      }
    },
    "northern_leaf_blight": {
      "name": "Bệnh đốm lá lớn trên Ngô",
      "info": {
        "description": "Đây là một bệnh do nấm Exserohilum turcicum gây ra. Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu đen trên lá của cây ngô.",
        "agent": "Nấm Exserohilum turcicum",
        "symptom": "Các vết bệnh có thể lan ra nhanh chóng, khiến cho lá và cây suy yếu và rụng sớm."
      }
    }
  },
  "GrapeDisease": {
    "black_rot": {
      "name": "Bệnh Thối đen trên Nho",
      "info": {
        "description": "Đây là một trong những bệnh phổ biến và nguy hiểm trên nho, do nấm Guignardia bidwellii gây ra. Bệnh thường lan rộng nhanh chóng trong điều kiện ẩm ướt.",
        "agent": "Nấm Guignardia bidwellii",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm màu đen trên lá, thân và quả của cây nho, gây ra sự suy yếu và giảm sản lượng."
      }
    },
    "blight": {
      "name": "Bệnh Chết sớm trên Nho",
      "info": {
        "description": "Bệnh chết sớm trên nho thường do nấm Elsinoë ampelina hoặc Botrytis cinerea gây ra. Bệnh thường phát triển mạnh mẽ trong điều kiện ẩm ướt và lạnh.",
        "agent": "Nấm Elsinoë ampelina hoặc Botrytis cinerea",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các vết đốm màu nâu đen trên lá và quả của cây nho, làm giảm năng suất và chất lượng nho."
      }
    },
    "esca": {
      "name": "Bệnh esca trên Nho",
      "info": {
        "description": "Bệnh esca trên nho thường do các loài nấm nhóm Phaeoacremonium, Phaeomoniella và Fomitiporia gây ra. Đây là một bệnh phức tạp và khó điều trị.",
        "agent": "Nấm nhóm Phaeoacremonium, Phaeomoniella và Fomitiporia",
        "symptom": "Các triệu chứng bao gồm héo và chết cành, lá và quả bị mất màu, và giảm năng suất của cây nho."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây nho khỏe mạnh sẽ có lá màu xanh tươi và quả chất lượng cao, không có dấu hiệu của bệnh tật."
      }
    }
  },
  "GuavaDisease": {
    "Canker": {
      "name": "Bệnh ghẻ",
      "info": {
        "description": "Bệnh ghẻ trên cây ổi là do vi khuẩn gây ra, tạo ra các vết loét trên thân và lá cây.",
        "agent": "Vi khuẩn Pseudomonas syringae",
        "symptom": "Xuất hiện các vết loét màu nâu, có thể làm cây bị yếu và giảm năng suất."
      }
    },
    "Dot": {
      "name": "Bệnh đốm",
      "info": {
        "description": "Bệnh đốm gây ra các đốm nhỏ trên lá và quả ổi, làm giảm chất lượng của quả.",
        "agent": "Nấm Phyllosticta psidii",
        "symptom": "Xuất hiện các đốm nhỏ, màu nâu hoặc đen trên lá và quả, có thể làm lá rụng sớm."
      }
    },
    "Healthy": {
      "name": "Cây khỏe mạnh",
      "info": {
        "description": "Cây ổi không bị nhiễm bất kỳ bệnh nào, lá và quả phát triển bình thường."
      }
    },
    "Mummification": {
      "name": "Bệnh thúi khô",
      "info": {
        "description": "Bệnh thúi khô làm cho quả ổi bị khô héo và cứng lại, giống như xác ướp.",
        "agent": "Nấm Aspergillus niger",
        "symptom": "Quả ổi bị khô héo, cứng lại và chuyển màu đen, không thể ăn được."
      }
    },
    "Rust": {
      "name": "Bệnh gỉ sắt",
      "info": {
        "description": "Bệnh gỉ sắt tạo ra các vết gỉ màu cam trên lá, làm giảm khả năng quang hợp của cây.",
        "agent": "Nấm Puccinia psidii",
        "symptom": "Xuất hiện các vết gỉ màu cam trên mặt dưới của lá, lá có thể rụng sớm."
      }
    }
  },
  "JackDisease": {
    "algal_spot": {
      "name": "Bệnh Đốm tảo trên Mít",
      "info": {
        "description": "Đây là một bệnh thường gặp trên cây jackfruit, do các loài tảo gây ra. Bệnh thường xuất hiện dưới dạng các vết đốm màu nâu hoặc đen trên lá cây.",
        "agent": "Tảo",
        "symptom": "Các vết bệnh có thể lan ra khắp cây, làm cho lá và cây suy yếu và ảnh hưởng đến năng suất."
      }
    },
    "black_spot": {
      "name": "Bệnh Đốm đen trên Mít",
      "info": {
        "description": "Đây là một bệnh do nấm gây ra, thường xuất hiện dưới dạng các vết đốm màu đen trên lá của cây jackfruit.",
        "agent": "Nấm",
        "symptom": "Các vết bệnh có thể lan ra khắp cây, làm cho lá và cây suy yếu và rụng lá sớm."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây jackfruit khỏe mạnh sẽ có lá màu xanh tươi, không có dấu hiệu của bệnh tật."
      }
    }
  },
  "MangoDisease": {
    "anthracnose": {
      "name": "Bệnh đốm nâu trên cây Xoài",
      "info": {
        "description": "Miêu tả: Bệnh đốm nâu trên cây xoài do nấm Colletotrichum gloeosporioides gây ra, là một trong những bệnh phổ biến và gây thiệt hại nặng nề nhất.\nTriệu chứng: Các đốm nâu xuất hiện trên lá, cành và quả, có thể làm héo và rụng lá, gây suy yếu cây và giảm năng suất.",
        "agent": "Nấm Colletotrichum gloeosporioides",
        "symptom": "Các đốm nâu trên lá, cành và quả, làm héo và rụng lá, gây suy yếu cây."
      }
    },
    "back_die": {
      "name": "Chết lưng cây Xoài",
      "info": {
        "description": "Miêu tả: Bệnh chết lưng cây xoài là do nấm Lasiodiplodia theobromae gây ra, thường xuất hiện sau khi cây bị tổn thương hoặc vào mùa mưa.\nTriệu chứng: Các vết thương trên vỏ thân và cành cây có thể lan ra và gây ra tình trạng chết lưng, làm suy yếu cây và giảm năng suất.",
        "agent": "Nấm Lasiodiplodia theobromae",
        "symptom": "Các vết thương trên vỏ thân và cành cây, làm chết lưng cây."
      }
    },
    "bacterial_canker": {
      "name": "Bệnh loét vi khuẩn trên cây Xoài",
      "info": {
        "description": "Miêu tả: Bệnh loét vi khuẩn trên cây Xoài do vi khuẩn Xanthomonas campestris pv. mangiferae gây ra, thường xuất hiện trên các bộ phận cây bị tổn thương.\nTriệu chứng: Các loét trên vỏ thân, cành và quả cây xoài, gây ra các vết thương và làm suy yếu cây.",
        "agent": "Vi khuẩn Xanthomonas campestris pv. mangiferae",
        "symptom": "Loét trên vỏ thân, cành và quả cây, gây ra các vết thương."
      }
    },
    "cutting_weevil": {
      "name": "Bọ cắn cây Xoài",
      "info": {
        "description": "Miêu tả: Bọ cắn cây xoài là loài côn trùng gây hại trên cây xoài, ăn lá và các bộ phận non của cây.\nTriệu chứng: Lỗ ăn trên lá và các bộ phận cây non, có thể gây ra thiệt hại nghiêm trọng đặc biệt vào giai đoạn non trưởng thành của cây.",
        "agent": "Loài côn trùng gây hại trên cây xoài",
        "symptom": "Lỗ ăn trên lá và các bộ phận non của cây."
      }
    },
    "gall_midge": {
      "name": "Ruồi đục thân cây Xoài",
      "info": {
        "description": "Miêu tả: Ruồi đục thân cây xoài là loài côn trùng nhỏ gây hại, ăn lá và các bộ phận non của cây, gây ra sự hình thành của các nang trên cây.\nTriệu chứng: Các nang trên thân, cành và lá cây xoài, gây ra sự suy yếu của cây và giảm năng suất.",
        "agent": "Loài côn trùng gây hại trên cây xoài",
        "symptom": "Các nang trên thân, cành và lá cây xoài."
      }
    },
    "healthy": {
      "name": "Cây xoài khỏe mạnh",
      "info": {
        "description": "Miêu tả: Một cây xoài khỏe mạnh sẽ có lá xanh tươi, cành rậm và quả chất lượng, không có dấu hiệu của bệnh tật hoặc sâu bệnh hại."
      }
    },
    "mildew_powdery": {
      "name": "Bệnh phấn trắng trên cây Xoài",
      "info": {
        "description": "Miêu tả: Bệnh phấn trắng trên cây xoài do nấm gây ra, thường xuất hiện vào mùa mưa.\nTriệu chứng: Lớp phủ màu trắng như bụi phấn trên lá và các bộ phận cây khác, gây ra các vết thương và làm suy yếu cây.",
        "agent": "Nấm gây bệnh trên cây xoài",
        "symptom": "Lớp phủ màu trắng như bụi phấn trên lá và các bộ phận cây khác."
      }
    },
    "mould_sooty": {
      "name": "Bệnh mốc than trên cây Xoài",
      "info": {
        "description": "Miêu tả: Bệnh mốc than trên cây xoài là do nấm Capnodium mangiferae gây ra.\nTriệu chứng: Lớp phủ màu đen trên lá và các bộ phận cây khác, gây ra sự suy yếu của cây và giảm năng suất.",
        "agent": "Nấm Capnodium mangiferae",
        "symptom": "Lớp phủ màu đen trên lá và các bộ phận cây khác."
      }
    }
  },
  "PeachDisease": {
    "bacterial_spot": {
      "name": "Bệnh Đốm vi khuẩn trên Lê",
      "info": {
        "description": "Đây là một trong những bệnh phổ biến trên đào, do vi khuẩn Xanthomonas campestris pv. pruni gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt.",
        "agent": "Vi khuẩn Xanthomonas campestris pv. pruni",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm nâu hoặc đen trên lá và quả của cây đào, gây suy yếu và giảm sản lượng."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây đào khỏe mạnh sẽ có lá màu xanh tươi và quả chất lượng cao, không có dấu hiệu của bệnh tật."
      }
    }
  },
  "PotatoDisease": {
    "early_blight": {
      "name": "Bệnh bạc lá sớm trên Lê",
      "info": {
        "description": "Đây là một bệnh phổ biến trên khoai tây, do nấm Alternaria solani gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt và nhiệt độ mát mẻ.",
        "agent": "Nấm Alternaria solani",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu trên lá của cây khoai tây, gây ra sự suy yếu và giảm năng suất."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây khoai tây khỏe mạnh sẽ có lá màu xanh tươi và củ chất lượng cao, không có dấu hiệu của bệnh tật."
      }
    },
    "late_blight": {
      "name": "Bệnh sương mai trên Lê",
      "info": {
        "description": "Đây là một bệnh phổ biến trên khoai tây, do nấm Phytophthora infestans gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt và nhiệt độ mát mẻ.",
        "agent": "Nấm Phytophthora infestans",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm nâu trên lá của cây khoai tây, gây ra sự suy yếu và giảm năng suất."
      }
    }
  },
  "RiceDisease": {
    "bacterial_leaf_blight": {
      "name": "Bệnh cháy bìa lá trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh cháy bìa lá là một trong những bệnh phổ biến và gây hại nghiêm trọng cho lúa, thường xảy ra trong điều kiện thời tiết ẩm ướt.",
        "agent": "Tác nhân: Do vi khuẩn Xanthomonas oryzae pv. oryzae gây ra.",
        "symptom": "Triệu chứng: Lá bị cháy từ bìa vào trong, thường có viền màu vàng nhạt bao quanh vết bệnh. Lá lúa bị nhiễm bệnh có thể khô héo và chết sớm."
      }
    },
    "blast": {
      "name": "Bệnh đạo ôn  trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh đạo ôn là một bệnh do nấm gây ra, ảnh hưởng nghiêm trọng đến năng suất lúa.",
        "agent": "Tác nhân: Do nấm Magnaporthe oryzae gây ra.",
        "symptom": "Triệu chứng: Xuất hiện các đốm hình thoi, màu xám hoặc nâu, thường có viền màu sẫm hơn. Các đốm này có thể xuất hiện trên lá, cổ lá, và hạt lúa."
      }
    },
    "blight": {
      "name": "Bệnh bạc lá  trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh bạc lá gây ra hiện tượng lá lúa bị khô héo và bạc màu.",
        "agent": "Tác nhân: Do vi khuẩn Xanthomonas oryzae pv. oryzicola gây ra.",
        "symptom": "Triệu chứng: Lá bị bạc màu từ chóp lá xuống, có thể thấy các vệt màu nâu trên bề mặt lá."
      }
    },
    "brown_spot": {
      "name": "Bệnh đốm nâu  trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh đốm nâu xuất hiện dưới dạng các đốm nhỏ màu nâu trên lá lúa.",
        "agent": "Tác nhân: Do nấm Bipolaris oryzae gây ra.",
        "symptom": "Triệu chứng: Các đốm nâu thường có hình tròn hoặc bầu dục, với viền màu nâu đậm hơn. Khi bệnh nặng, các đốm này có thể hợp lại và làm lá khô héo."
      }
    },
    "healthy": {
      "name": "Lúa khỏe mạnh ",
      "info": {
        "description": "Miêu tả: Cây lúa khỏe mạnh có lá màu xanh tươi, không có đốm hay dấu hiệu của bệnh tật. Cây phát triển mạnh mẽ và cho năng suất cao."
      }
    },
    "narrow_brown_spot": {
      "name": "Bệnh đốm nâu hẹp trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh đốm nâu hẹp là một bệnh do nấm gây ra, ảnh hưởng đến lá lúa.",
        "agent": "Tác nhân: Do nấm Cercospora oryzae gây ra.",
        "symptom": "Triệu chứng: Xuất hiện các đốm nâu nhỏ, hẹp và dài trên lá, thường có viền màu nâu đậm hơn."
      }
    },
    "scald": {
      "name": "Bệnh khô vằn  trên Lúa",
      "info": {
        "description": "Miêu tả: Bệnh khô vằn là một bệnh phổ biến trên lúa, gây ra bởi nấm.",
        "agent": "Tác nhân: Do nấm Rhizoctonia solani gây ra.",
        "symptom": "Triệu chứng: Xuất hiện các đốm màu xanh nhạt hoặc vàng trên lá, sau đó chuyển thành các vệt màu nâu, làm lá bị khô và chết."
      }
    }
  },
  "StrawberryDisease": {
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây dâu tây khỏe mạnh sẽ có lá màu xanh tươi và quả chất lượng cao, không có dấu hiệu của bệnh tật."
      }
    },
    "leaf_scorch": {
      "name": "Bệnh cháy lá trên Dâu",
      "info": {
        "description": "Đây là một bệnh phổ biến trên dâu tây, do điều kiện nắng nóng kéo dài gây ra.",
        "agent": "Điều kiện thời tiết nắng nóng",
        "symptom": "Các lá bị cháy nắng thường có các đốm khô và héo, ảnh hưởng đến năng suất và chất lượng quả."
      }
    }
  },
  "TeaDisease": {
    "algal_leaf": {
      "name": "Bệnh lá tảo",
      "info": {
        "description": "Bệnh lá tảo gây ra những vết bệnh màu xanh lục hoặc vàng trên lá, làm giảm khả năng quang hợp của cây.",
        "agent": "Do tảo Cephaleuros virescens gây ra.",
        "symptom": "Lá có vết bệnh hình tròn hoặc không đều, màu xanh lục hoặc vàng."
      }
    },
    "anthracnose": {
      "name": "Bệnh thán thư",
      "info": {
        "description": "Bệnh thán thư gây ra các vết bệnh màu nâu hoặc đen trên lá và cành, làm giảm năng suất của cây.",
        "agent": "Do nấm Colletotrichum gây ra.",
        "symptom": "Lá và cành có vết bệnh hình tròn hoặc không đều, màu nâu hoặc đen."
      }
    },
    "bird_eye_spot": {
      "name": "Bệnh đốm mắt chim",
      "info": {
        "description": "Bệnh đốm mắt chim gây ra các vết bệnh hình tròn, màu nâu với viền đen, giống như mắt chim trên lá.",
        "agent": "Do nấm Cercospora theae gây ra.",
        "symptom": "Lá có các vết bệnh hình tròn, màu nâu với viền đen."
      }
    },
    "brown_blight": {
      "name": "Bệnh đốm nâu",
      "info": {
        "description": "Bệnh đốm nâu gây ra các vết bệnh màu nâu trên lá và cành, làm cho lá và cành bị chết khô.",
        "agent": "Do nấm Glomerella cingulata gây ra.",
        "symptom": "Lá và cành có các vết bệnh màu nâu, làm lá và cành bị chết khô."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Cây chè khỏe mạnh không có bất kỳ dấu hiệu bệnh tật nào, lá và cành đều xanh tươi và phát triển tốt."
      }
    },
    "red_leaf_spot": {
      "name": "Bệnh đốm đỏ",
      "info": {
        "description": "Bệnh đốm đỏ gây ra các vết bệnh màu đỏ trên lá, làm giảm khả năng quang hợp và sức sống của cây.",
        "agent": "Do nấm Phyllosticta theicola gây ra.",
        "symptom": "Lá có các vết bệnh hình tròn hoặc không đều, màu đỏ."
      }
    }
  },
  "TomatoDisease": {
    "bacterial_spot": {
      "name": "Bệnh Đốm vi khuẩn trên Cà chua",
      "info": {
        "description": "Đây là một trong những bệnh phổ biến trên cây cà chua, do vi khuẩn Xanthomonas campestris pv. vesicatoria gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt.",
        "agent": "Vi khuẩn Xanthomonas campestris pv. vesicatoria",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm nâu đen trên lá và quả của cây cà chua, gây ra sự suy yếu và giảm năng suất."
      }
    },
    "curl_virus": {
      "name": "Bệnh Vi rút cuộn lá  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh do vi rút gây ra, thường được truyền bởi côn trùng như bọ xít.",
        "agent": "Begomovirus, Tomato Mosaic",
        "symptom": "Các triệu chứng bao gồm các lá cây bị cuộn và biến dạng, gây ra sự suy yếu và giảm năng suất của cây cà chua."
      }
    },
    "early_blight": {
      "name": "Bệnh đốm sớm  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh phổ biến trên cây cà chua, do nấm Alternaria solani gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt và nhiệt độ mát mẻ.",
        "agent": "Nấm Alternaria solani",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu trên lá của cây cà chua, gây ra sự suy yếu và giảm năng suất."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Một cây cà chua khỏe mạnh sẽ có lá màu xanh tươi và quả chất lượng cao, không có dấu hiệu của bệnh tật."
      }
    },
    "late_blight": {
      "name": "Bệnh đốm muộn  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh phổ biến trên cây cà chua, do nấm Phytophthora infestans gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt và nhiệt độ mát mẻ.",
        "agent": "Nấm Phytophthora infestans",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu trên lá của cây cà chua, gây ra sự suy yếu và giảm năng suất."
      }
    },
    "leaf_mold": {
      "name": "Nấm phủ lá  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh do nấm gây ra, thường xuất hiện dưới dạng các lớp phủ màu nâu hoặc xám trên lá của cây cà chua.",
        "agent": "Nấm",
        "symptom": "Các lá bị nhiễm bệnh thường có các lớp phủ màu nâu hoặc xám, làm giảm khả năng quang hợp của cây."
      }
    },
    "mosaic_virus": {
      "name": "Vi rút lai  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh do vi rút gây ra, thường được truyền bởi côn trùng như bọ xít.",
        "agent": "Vi rút",
        "symptom": "Các triệu chứng bao gồm các lá cây có màu sắc không đồng đều và biến dạng, gây ra sự suy yếu và giảm năng suất của cây cà chua."
      }
    },
    "septoria_leaf_spot": {
      "name": "Bệnh Đốm lá trên Cà chua",
      "info": {
        "description": "Đây là một bệnh phổ biến trên cây cà chua, do nấm Septoria lycopersici gây ra. Bệnh thường phát triển trong điều kiện ẩm ướt.",
        "agent": "Nấm Septoria lycopersici",
        "symptom": "Các vết bệnh thường xuất hiện dưới dạng các đốm màu nâu trên lá của cây cà chua, gây ra sự suy yếu và giảm năng suất."
      }
    },
    "spot": {
      "name": "Bệnh Đốm  trên Cà chua",
      "info": {
        "description": "Đây là một bệnh do nấm gây ra, thường xuất hiện dưới dạng các vết đốm màu nâu hoặc đen trên lá của cây cà chua.",
        "agent": "Nấm",
        "symptom": "Các vết bệnh có thể lan ra khắp cây, làm giảm năng suất và chất lượng của quả cà chua."
      }
    }
  },
  "WheatDisease": {
    "brown_rust": {
      "name": "Rỉ sắt nâu",
      "info": {
        "description": "Rỉ sắt nâu là một bệnh do nấm gây ra, gây hại cho lá và thân của cây lúa mì, làm giảm năng suất và chất lượng hạt.",
        "agent": "Nấm Puccinia triticina",
        "symptom": "Xuất hiện các đốm màu nâu đỏ trên lá và thân cây. Các đốm này có thể liên kết với nhau tạo thành các vùng rỉ sắt lớn."
      }
    },
    "healthy": {
      "name": "Khỏe mạnh",
      "info": {
        "description": "Cây lúa mì khỏe mạnh không có dấu hiệu của bất kỳ bệnh nào. Lá và thân cây có màu xanh tươi, không có đốm hoặc vết bất thường."
      }
    },
    "yellow_rust": {
      "name": "Rỉ sắt vàng",
      "info": {
        "description": "Rỉ sắt vàng là một bệnh do nấm gây ra, gây tổn thương nghiêm trọng đến cây lúa mì, dẫn đến giảm năng suất và chất lượng hạt.",
        "agent": "Nấm Puccinia striiformis",
        "symptom": "Lá cây bị nhiễm bệnh có các đốm màu vàng nhạt, sau đó chuyển sang màu nâu hoặc đỏ. Các đốm này thường xuất hiện trên bề mặt của lá và có thể lan rộng ra toàn bộ cây."
      }
    }
  }
}
